TexasInstruments/mcupsdk-core/examples/drivers/boot/sbl_ospi_swap/am261x-lp/r5fss0-0_nortos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM261x_ZFG" --part "AM2612" --package "ZFG" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2612" --package "NFBGA (ZFG)" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.21.2+3837"}
 */

/**
 * Import the modules used in this configuration.
 */
const flash       = scripting.addModule("/board/flash/flash", {}, false);
const flash1      = flash.addInstance();
const pmic        = scripting.addModule("/board/pmic/pmic", {}, false);
const pmic1       = pmic.addInstance();
const bootloader  = scripting.addModule("/drivers/bootloader/bootloader", {}, false);
const bootloader1 = bootloader.addInstance();
const gpio        = scripting.addModule("/drivers/gpio/gpio", {}, false);
const gpio1       = gpio.addInstance();
const hsmclient   = scripting.addModule("/drivers/hsmclient/hsmclient", {}, false);
const hsmclient1  = hsmclient.addInstance();
const i2c         = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1        = i2c.addInstance();
const debug_log   = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg     = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7   = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71  = mpu_armv7.addInstance();
const mpu_armv72  = mpu_armv7.addInstance();
const mpu_armv73  = mpu_armv7.addInstance();
const mpu_armv74  = mpu_armv7.addInstance();
const mpu_armv75  = mpu_armv7.addInstance();
const mpu_armv76  = mpu_armv7.addInstance();
const mpu_armv77  = mpu_armv7.addInstance();
const general     = scripting.addModule("/memory_configurator/general", {}, false);
const general1    = general.addInstance();
const region      = scripting.addModule("/memory_configurator/region", {}, false);
const region1     = region.addInstance();
const section     = scripting.addModule("/memory_configurator/section", {}, false);
const section1    = section.addInstance();
const section2    = section.addInstance();
const section3    = section.addInstance();
const section4    = section.addInstance();
const section5    = section.addInstance();
const section6    = section.addInstance();
const section7    = section.addInstance();
const fota        = scripting.addModule("/optiflash/fota/fota", {}, false);
const fota1       = fota.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
pmic1.$name = "CONFIG_PMIC0";
pmic1.name  = scripting.invalidAssignment("TPS65036xx", "a backwards compatibility discrepancy");

bootloader1.$name          = "CONFIG_BOOTLOADER0";
bootloader1.appImageOffset = "0x00080000";

bootloader1.flashDriver                   = flash1;
flash1.$name                              = "CONFIG_FLASH0";
flash1.strDtr_isAddrReg                   = true;
flash1.strDtr_cmdRegRd                    = "0x85";
flash1.strDtr_cmdRegWr                    = "0x81";
flash1.strDtr_mask                        = "255";
flash1.xspiWipRdCmd                       = "0x05";
flash1.strDtr_shift                       = 255;
flash1.protocol                           = "8d_8d_8d";
flash1.fourByteEnableSeq                  = "0";
flash1.cmdRd                              = "0x7c";
flash1.dummy_mask                         = "0xff";
flash1.flashDeviceId                      = "0x5B17";
flash1.peripheralDriver.$name             = "CONFIG_OSPI0";
flash1.peripheralDriver.dmaEnable         = true;
flash1.peripheralDriver.OSPI.CLK.$assign  = scripting.invalidAssignment("GPIO10", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.CSn0.$assign = scripting.invalidAssignment("GPIO62", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.DQS.$assign  = scripting.invalidAssignment("GPIO9", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D7.$assign   = scripting.invalidAssignment("GPIO68", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D6.$assign   = scripting.invalidAssignment("GPIO8", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D5.$assign   = scripting.invalidAssignment("GPIO67", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D4.$assign   = scripting.invalidAssignment("GPIO76", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D3.$assign   = scripting.invalidAssignment("GPIO69", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D2.$assign   = scripting.invalidAssignment("GPIO7", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D1.$assign   = scripting.invalidAssignment("GPIO70", "a backwards compatibility discrepancy");
flash1.peripheralDriver.OSPI.D0.$assign   = scripting.invalidAssignment("GPIO2", "a backwards compatibility discrepancy");
flash1.peripheralDriver.child.$name       = "drivers_ospi_v0_ospi_v0_am261x_template0";

const edma                         = scripting.addModule("/drivers/edma/edma", {}, false);
const edma2                        = edma.addInstance({}, false);
edma2.$name                        = "CONFIG_EDMA0";
flash1.peripheralDriver.edmaDriver = edma2;
edma2.edmaRmDmaCh[0].$name         = "CONFIG_EDMA_RM0";
edma2.edmaRmQdmaCh[0].$name        = "CONFIG_EDMA_RM1";
edma2.edmaRmTcc[0].$name           = "CONFIG_EDMA_RM2";
edma2.edmaRmParam[0].$name         = "CONFIG_EDMA_RM3";

gpio1.pinDir         = "OUTPUT";
gpio1.$name          = "GPIO_OSPI_RST";
gpio1.defaultValue   = "1";
gpio1.GPIO_n.$assign = scripting.invalidAssignment("GPIO61", "a backwards compatibility discrepancy");

hsmclient1.$name = "CONFIG_HSMCLIENT0";

i2c1.$name           = "CONFIG_I2C0";
i2c1.I2C.$assign     = "I2C0";
i2c1.I2C_child.$name = "drivers_i2c_v1_i2c_v1_template0";

const mcspi                  = scripting.addModule("/drivers/mcspi/mcspi", {}, false);
const mcspi1                 = mcspi.addInstance({}, false);
mcspi1.$name                 = "CONFIG_MCSPI0";
mcspi1.peripheralDriver      = scripting.invalidAssignment({"$hardware":null,"$module":"/drivers/i2c/i2c","$name":"CONFIG_I2C0","$sharedBy":[],"$uiState":{"$hardware":{"hidden":true,"readOnly":false},"$name":{"hidden":false,"readOnly":false},"I2C":{"hidden":false,"readOnly":false},"I2C_child":{"hidden":false,"readOnly":false},"advanced":{"hidden":true,"readOnly":false},"bitRate":{"hidden":false,"readOnly":false},"enableIntr":{"hidden":false,"readOnly":false},"intrPriority":{"hidden":false,"readOnly":false},"ownTargetAddr":{"hidden":false,"readOnly":false},"sdkInfra":{"hidden":false,"readOnly":false},"transferCallbackFxn":{"hidden":true,"readOnly":false},"transferMode":{"hidden":false,"readOnly":false}},"I2C":{"$assign":"I2C0","$assignAllowConflicts":"Any","$interface":"I2C","$name":"MyI2C1","$solution":{"peripheralName":"I2C0","voltage":"","error":"","warning":""},"$suggestSolution":"Any","SCL":{"$assign":"Any","$assignAllowConflicts":"Any","$interfacePins":["SCL"],"$solution":{"peripheralPinName":"I2C0_SCL","devicePinName":"I2C0_SCL","packagePinName":"A13","muxMode":"0","warning":"Solution has changed","error":""},"$suggestSolution":"<invalid>","$used":true,"pu_pd":"nopull","slewRate":"low"},"SDA":{"$assign":"Any","$assignAllowConflicts":"Any","$interfacePins":["SDA"],"$solution":{"peripheralPinName":"I2C0_SDA","devicePinName":"I2C0_SDA","packagePinName":"B13","muxMode":"0","warning":"Solution has changed","error":""},"$suggestSolution":"<invalid>","$used":true,"pu_pd":"nopull","slewRate":"low"}},"I2C_child":{"$hardware":null,"$module":"/drivers/i2c/v1/i2c_v1_template","$name":"drivers_i2c_v1_i2c_v1_template0","$ownedBy":"CONFIG_I2C0","$sharedBy":[],"$uiState":{"$hardware":{"hidden":true,"readOnly":false},"$name":{"hidden":true,"readOnly":false}}},"advanced":false,"bitRate":"400KHZ","enableIntr":true,"intrPriority":4,"ownTargetAddr":28,"sdkInfra":"HLD","transferCallbackFxn":"NULL","transferMode":"BLOCKING"}, "a backwards compatibility discrepancy");
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";
mcspi1.child.$name           = "drivers_mcspi_v1_mcspi_v1_template0";

const edma1                 = edma.addInstance({}, false);
edma1.$name                 = "CONFIG_EDMA0";
mcspi1.edmaDriver           = edma1;
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.intrEnable       = "DISABLE";
debug_log.uartLog.UART.RXD.$assign = scripting.invalidAssignment("GPIO27", "a backwards compatibility discrepancy");
debug_log.uartLog.UART.TXD.$assign = scripting.invalidAssignment("GPIO28", "a backwards compatibility discrepancy");
debug_log.uartLog.child.$name      = "drivers_uart_v2_uart_v2_template0";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

