TexasInstruments/mcupsdk-core/examples/drivers/boot/sbl_ospi_swap/am261x-lp/r5fss0-0_nortos/example.syscfg
mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;
mpu_armv74.attributes        = "Cached+Sharable";

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Device";
mpu_armv75.baseAddr     = 0xCE000000;
mpu_armv75.size         = 24;

mpu_armv76.$name             = "FLASH_RGN";
mpu_armv76.baseAddr          = 0x80000000;
mpu_armv76.size              = 27;
mpu_armv76.attributes        = "Device";
mpu_armv76.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv77.$name      = "CONFIG_MPU_REGION5";
mpu_armv77.baseAddr   = 0x88000000;
mpu_armv77.attributes = "Device";
mpu_armv77.size       = 27;

general1.$name          = "CONFIG_GENERAL0";
general1.irq_stack_size = 4096;
general1.stack_size     = 8192;
general1.heap_size      = 8192;
general1.linker.$name   = "TIARMCLANG0";

region1.$name                               = "MEMORY_REGION_CONFIGURATION";
region1.memory_region.create(10);
region1.memory_region[0].type               = "TCMA";
region1.memory_region[0].$name              = "R5F_VECS";
region1.memory_region[0].auto               = false;
region1.memory_region[0].size               = 0x100;
region1.memory_region[1].type               = "TCMA";
region1.memory_region[1].$name              = "R5F_TCMA";
region1.memory_region[1].auto               = false;
region1.memory_region[1].manualStartAddress = 0x100;
region1.memory_region[1].size               = 0x7F00;
region1.memory_region[2].type               = "TCMB";
region1.memory_region[2].size               = 0x8000;
region1.memory_region[2].$name              = "R5F_TCMB0";
region1.memory_region[2].manualStartAddress = 0x41010000;
region1.memory_region[3].$name              = "MSRAM_VECS";
region1.memory_region[3].auto               = false;
region1.memory_region[3].manualStartAddress = 0x70002000;
region1.memory_region[3].size               = 0x100;
region1.memory_region[4].$name              = "MSRAM_0";
region1.memory_region[4].auto               = false;
region1.memory_region[4].manualStartAddress = 0x70002100;
region1.memory_region[4].size               = 0x3FF00;
region1.memory_region[5].$name              = "MSRAM_HSMRT";
region1.memory_region[5].manualStartAddress = 0x70032000;
region1.memory_region[5].size               = 0x40000;
region1.memory_region[6].type               = "CUSTOM";
region1.memory_region[6].$name              = "MAILBOX_HSM";
region1.memory_region[6].auto               = false;
region1.memory_region[6].manualStartAddress = 0x44000000;
region1.memory_region[6].size               = 0x3CE;
region1.memory_region[7].type               = "CUSTOM";
region1.memory_region[7].size               = 0x3CE;
region1.memory_region[7].$name              = "MAILBOX_R5F";
region1.memory_region[7].auto               = false;
region1.memory_region[7].manualStartAddress = 0x44000400;
region1.memory_region[8].type               = "FLASH";
region1.memory_region[8].auto               = false;
region1.memory_region[8].manualStartAddress = 0x60080000;
region1.memory_region[8].size               = 0x1000;
region1.memory_region[8].$name              = "FLASH_BOOTINFO_SECTOR";
region1.memory_region[9].last_sym           = "__TI_SBL_FLASH_BOOTINFO_SECTOR_START";
region1.memory_region[9].auto               = false;
region1.memory_region[9].type               = "CUSTOM";
region1.memory_region[9].$name              = "BOOT_SECTOR_INFO";
region1.memory_region[9].manualStartAddress = 0x80080000;
region1.memory_region[9].size               = 0x1000;

section1.load_memory                              = "MSRAM_VECS";
section1.group                                    = false;
section1.run_memory                               = "R5F_VECS";
section1.$name                                    = "Sbl Initialization Code";
section1.output_section.create(1);
section1.output_section[0].$name                  = ".sbl_init_code";
section1.output_section[0].input_section.create(1);
section1.output_section[0].input_section[0].$name = "*(.vectors). = align(8);";

section2.load_memory                  = "MSRAM_0";
section2.$name                        = "Text Segments";
section2.output_section.create(7);
section2.output_section[0].$name      = ".text";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.hwi";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.cache";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.mpu";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text.boot";
section2.output_section[4].palignment = true;
section2.output_section[5].$name      = ".data";
section2.output_section[5].palignment = true;
section2.output_section[6].$name      = ".rodata";
section2.output_section[6].palignment = true;

section3.load_memory                             = "MSRAM_0";
section3.group                                   = false;
section3.$name                                   = "Memory Segments";
section3.output_section.create(3);
section3.output_section[0].$name                 = ".bss";
section3.output_section[0].output_sections_start = "__BSS_START";
section3.output_section[0].output_sections_end   = "__BSS_END";
section3.output_section[0].palignment            = true;
section3.output_section[1].$name                 = ".sysmem";
section3.output_section[1].palignment            = true;
section3.output_section[2].$name                 = ".stack";
section3.output_section[2].palignment            = true;

