TexasInstruments/mcupsdk-core/examples/drivers/boot/sbl_ospi_swap/am261x-lp/r5fss0-0_nortos/example.syscfg
section4.load_memory                              = "MSRAM_0";
section4.$name                                    = "Stack Segments";
section4.output_section.create(5);
section4.output_section[0].$name                  = ".irqstack";
section4.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section4.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section4.output_section[0].input_section.create(1);
section4.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section4.output_section[1].$name                  = ".fiqstack";
section4.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section4.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section4.output_section[1].input_section.create(1);
section4.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section4.output_section[2].$name                  = ".svcstack";
section4.output_section[2].output_sections_start  = "__SVC_STACK_START";
section4.output_section[2].output_sections_end    = "__SVC_STACK_END";
section4.output_section[2].input_section.create(1);
section4.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section4.output_section[3].$name                  = ".abortstack";
section4.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section4.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section4.output_section[3].input_section.create(1);
section4.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section4.output_section[4].$name                  = ".undefinedstack";
section4.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section4.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section4.output_section[4].input_section.create(1);
section4.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section5.load_memory             = "MSRAM_HSMRT";
section5.group                   = false;
section5.$name                   = "Hsmrt";
section5.output_section.create(1);
section5.output_section[0].$name = ".rodata.hsmrt";

section6.load_memory                 = "MAILBOX_HSM";
section6.type                        = "NOLOAD";
section6.group                       = false;
section6.$name                       = "SIPC HSM Queue Memory";
section6.output_section.create(1);
section6.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section6.output_section[0].alignment = 0;

section7.load_memory                 = "MAILBOX_R5F";
section7.type                        = "NOLOAD";
section7.group                       = false;
section7.$name                       = "SIPC R5F Queue Memory";
section7.output_section.create(1);
section7.output_section[0].$name     = ".bss.sipc_secure_host_queue_mem";
section7.output_section[0].alignment = 0;

fota1.$name = "fota0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
flash1.peripheralDriver.OSPI.$suggestSolution      = "OSPI0";
flash1.peripheralDriver.OSPI.CLK.$suggestSolution  = "OSPI0_CLK";
flash1.peripheralDriver.OSPI.CSn0.$suggestSolution = "EPWM11_A";
flash1.peripheralDriver.OSPI.DQS.$suggestSolution  = "UART1_TXD";
flash1.peripheralDriver.OSPI.D7.$suggestSolution   = "EPWM12_B";
flash1.peripheralDriver.OSPI.D6.$suggestSolution   = "MCAN1_RX";
flash1.peripheralDriver.OSPI.D5.$suggestSolution   = "EPWM12_A";
flash1.peripheralDriver.OSPI.D4.$suggestSolution   = "MCAN0_RX";
flash1.peripheralDriver.OSPI.D3.$suggestSolution   = "EPWM13_A";
flash1.peripheralDriver.OSPI.D2.$suggestSolution   = "MCAN0_TX";
flash1.peripheralDriver.OSPI.D1.$suggestSolution   = "EPWM11_B";
flash1.peripheralDriver.OSPI.D0.$suggestSolution   = "OSPI0_CSn0";
gpio1.GPIO_n.$suggestSolution                      = "OSPI0_CSn1";
i2c1.I2C.SCL.$suggestSolution                      = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                      = "I2C0_SDA";
mcspi1.SPI.$suggestSolution                        = "SPI0";
mcspi1.SPI.CLK.$suggestSolution                    = "SPI0_CLK";
mcspi1.SPI.D0.$suggestSolution                     = "SPI0_D0";
mcspi1.SPI.D1.$suggestSolution                     = "SPI0_D1";
mcspi1.mcspiChannel[0].CSn.$suggestSolution        = "SPI0_CS0";
debug_log.uartLog.UART.$suggestSolution            = "UART0";
debug_log.uartLog.UART.RXD.$suggestSolution        = "MMC_CLK";
debug_log.uartLog.UART.TXD.$suggestSolution        = "MMC_CMD";
